sunitha-rs/documents/Serial_Ports/case_3/uarthardware/P18F46K22Generic.h

#define High	1
#define Low		0


//DAY1

//ANSELA – PORTA ANALOG SELECT REGISTER
#define ANSELA_RESERVED_BIT7		0X00		
#define ANSELA_RESERVED_BIT6		0X00
#define ANSELA_ANSA5_SET			0X20			//Analog Select bit
#define ANSELA_ANSA5_CLR			0X00
#define ANSELA_RESERVED_BIT4		0X00
#define ANSELA_ANSA3_SET			0X08
#define ANSELA_ANSA3_CLR			0X00
#define ANSELA_ANSA2_SET			0X04
#define ANSELA_ANSA2_CLR			0X00
#define ANSELA_ANSA1_SET			0X02
#define ANSELA_ANSA1_CLR			0X00
#define ANSELA_ANSA0_SET			0X01
#define ANSELA_ANSA0_CLR			0X00

//ANSELB – PORTB ANALOG SELECT REGISTER
#define ANSELB_RESERVED_BIT7		0X00		
#define ANSELB_RESERVED_BIT6		0X00
#define ANSELB_ANSB5_SET			0X20			//Analog Select bit 
#define ANSELB_ANSB5_CLR			0X00
#define ANSELB_ANSB4_SET			0X10			
#define ANSELB_ANSB4_CLR			0X00
#define ANSELB_ANSB3_SET			0X08
#define ANSELB_ANSB3_CLR			0X00
#define ANSELB_ANSB2_SET			0X04
#define ANSELB_ANSB2_CLR			0X00
#define ANSELB_ANSB1_SET			0X02
#define ANSELB_ANSB1_CLR			0X00
#define ANSELB_ANSB0_SET			0X01
#define ANSELB_ANSB0_CLR			0X00

//ANSELC – PORTC ANALOG SELECT REGISTER




//ANSELC – PORTC ANALOG SELECT REGISTER
# define ANSELC_ANSC7_SET			0X80			//Analog Select bit 
# define ANSELC_ANSC7_CLR			0X00
# define ANSELC_ANSC6_SET			0X40
# define ANSELC_ANSC6_CLR			0X00
# define ANSELC_ANSC5_SET			0X20
# define ANSELC_ANSC5_CLR			0X00
# define ANSELC_ANSC4_SET			0X10
# define ANSELC_ANSC4_CLR			0X00
# define ANSELC_ANSC3_SET			0X08
# define ANSELC_ANSC3_CLR			0X00
# define ANSELC_ANSC2_SET			0X04
# define ANSELC_ANSC2_CLR			0X00
# define ANSELC_RESERVED_BIT1		0X00
# define ANSELC_RESERVED_BIT0		0X00

//ANSELD – PORTD ANALOG SELECT REGISTER
# define ANSELD_ANSD7_SET			0X80		
# define ANSELD_ANSD7_CLR			0X00
# define ANSELD_ANSD6_SET			0X40
# define ANSELD_ANSD6_CLR			0X00
# define ANSELD_ANSD5_SET			0X20
# define ANSELD_ANSD5_CLR			0X00
# define ANSELD_ANSD4_SET			0X10
# define ANSELD_ANSD4_CLR			0X00
# define ANSELD_ANSD3_SET			0X08
# define ANSELD_ANSD3_CLR			0X00
# define ANSELD_ANSD2_SET			0X04
# define ANSELD_ANSD2_CLR			0X00
# define ANSELD_ANSD1_SET			0X02
# define ANSELD_ANSD1_CLR			0X00
# define ANSELD_ANSD0_SET			0X01
# define ANSELD_ANSD0_CLR			0X00

//ANSELE – PORTE ANALOG SELECT REGISTER
#define ANSELE_RESERVED_BIT7		0x00
#define ANSELE_RESERVED_BIT6		0x00
#define ANSELE_RESERVED_BIT5		0x00
#define ANSELE_RESERVED_BIT4		0x00
#define ANSELE_RESERVED_BIT3		0x00
#define ANSELE_ANSE2_SET			0x04
#define ANSELE_ANSE2_CLR			0x00
#define ANSELE_ANSE1_SET			0x02
#define ANSELE_ANSE1_CLR			0x00
#define ANSELE_ANSE0_SET			0x01
#define ANSELE_ANSE0_CLR			0x00

// OSCTUNE: OSCILLATOR TUNING REGISTER 
#define OSCTUNE_INTSRC_INTOSC 		0x80
#define OSCTUNE_INTSRC_INTRC 		0x00
#define OSCTUNE_PLLEN_ENABLE 		0x40
#define OSCTUNE_PLLEN_DISABLE 		0x00
#define OSCTUNE_TUN5_SET			0x20
#define OSCTUNE_TUN5_CLR			0x00
#define OSCTUNE_TUN4_SET			0x10
#define OSCTUNE_TUN4_CLR			0x00
#define OSCTUNE_TUN3_SET			0x08
#define OSCTUNE_TUN3_CLR			0x00
#define OSCTUNE_TUN2_SET			0x04
#define OSCTUNE_TUN2_CLR			0x00
#define OSCTUNE_TUN1_SET			0x02
#define OSCTUNE_TUN1_CLR			0x00
#define OSCTUNE_TUN0_SET			0x01
#define OSCTUNE_TUN0_CLR			0x00



//OSCCON REGISTER
#define OSCCON_IDLEN_ENABLE			0x80
#define OSCCON_IDLEN_DISABLE		0x00
#define OSCCON_IRCF2_SET			0x40	
#define OSCCON_IRCF2_CLR			0x00	
#define OSCCON_IRCF1_SET			0x20	
#define OSCCON_IRCF1_CLR			0x00	
#define OSCCON_IRCF0_SET			0x10	
#define OSCCON_IRCF0_CLR			0x00
#define OSCCON_OSTS_INTOSC_RUNNING		0x00
#define OSCCON_OSTS_FOSC_RUNNING	0x08
#define OSCCON_HFIOFS_STABLE			0X04
#define OSCCON_HFIOFS_UNSTABLE			0X00
#define OSCCON_SCS1_SET					0x02		
#define OSCCON_SCS1_CLR					0x00					
#define OSCCON_SCS0_SET					0x01		
#define OSCCON_SCS0_CLR					0x00		

//OSCCONE2 REGISTER
#define OSCCONE2_PLLRDY_4xPLL_CLOCK				0x80
#define OSCCONE2_PLLRDY_OSCILLATOR_CLOCK		0x00
#define OSCCONE2_SOSCRUN_SECONDARY_CLOCK		0x40
#define OSCCONE2_SOSCRUN_OSCILLATOR_CLOCK		0x00
#define OSCCONE2_UNIMPLIMENTED					0x00 
#define OSCCONE2_MFIOSEL_SET					0x10
#define OSCCONE2_MFIOSEL_CLR					0x00	
#define OSCCONE2_SOSCGO_ENABLE					0x08
#define OSCCONE2_SOSCGO_DISABLE					0x00	
#define OSCCONE2_PRISD_SET						0x04
#define OSCCONE2_PRISD_CLR						0x00		
#define OSCCONE2_MFIOFS_STABLE					0x02
#define OSCCONE2_MFIOFS_UNSTABLE				0x00
#define OSCCONE2_LFIOFS_STABLE					0x01
#define OSCCONE2_LFIOFS_UNSTABLE				0x00

//TXSTA1: TRANSMIT STATUS AND CONTROL REGISTER
#define TXSTA1_CSRC_SYN_MASTER		0X80
#define TXSTA1_CSRC_SYN_SLAVE		0X00
#define TXSTA1_TX9_9BIT_MODE		0X40
#define TXSTA1_TX9_8BIT_MODE		0X00
#define TXSTA1_TXEN_ENABLE			0X20
#define TXSTA1_TXEN_DISABLE			0X00
#define TXSTA1_SYNC_SET				0X10		//EUSART Mode Select bit
#define TXSTA1_SYNC_CLR				0X00
#define TXSTA1_SENDB_SYNC_BRK_CONTINUE	 0X08	//Send Break Character bit
#define TXSTA1_SENDB_SYNC_BRK_COMPLETE	 0X00
//TXSTA1_SENDB:Synchronous mode:Don’t care	
#define TXSTA1_BRGH_HIGH_SPEED		0X04		//High Baud Rate Select bit		
#define TXSTA1_BRGH_LOW_SPEED		0X00
//TXSTA_BRGH_SYN					UNUSED		//Synchronous mode:Unused in this mode
#define TXSTA1_TRMT_TSR_EMPTY		1
#define TXSTA1_TRMT_TSR_FULL		0
#define TXSTA1_TX9D_SET				0X01
#define TXSTA1_TX9D_CLR				0X00

//TXSTA1: TRANSMIT STATUS AND CONTROL REGISTER
#define TXSTA2_CSRC_SYN_MASTER		0X80
#define TXSTA2_CSRC_SYN_SLAVE		0X00
#define TXSTA2_TX9_9BIT_MODE		0X40
#define TXSTA2_TX9_8BIT_MODE		0X00
#define TXSTA2_TXEN_ENABLE			0X20
#define TXSTA2_TXEN_DISABLE			0X00
#define TXSTA2_SYNC_SET				0X10		//EUSART Mode Select bit
#define TXSTA2_SYNC_CLR				0X00
#define TXSTA2_SENDB_SYNC_BRK_CONTINUE	 0X08	//Send Break Character bit
#define TXSTA2_SENDB_SYNC_BRK_COMPLETE	 0X00
//TXSTA1_SENDB:Synchronous mode:Don’t care	
#define TXSTA2_BRGH_HIGH_SPEED		0X04		//High Baud Rate Select bit		
#define TXSTA2_BRGH_LOW_SPEED		0X00
//TXSTA_BRGH_SYN					UNUSED		//Synchronous mode:Unused in this mode
#define TXSTA2_TRMT_TSR_EMPTY		1
#define TXSTA2_TRMT_TSR_FULL		0
#define TXSTA2_TX9D_SET				0X01
#define TXSTA2_TX9D_CLR				0X00

//RCSTA1: RECEIVE STATUS AND CONTROL REGISTER
#define RCSTA1_SPEN_ENABLE						0X80		//Serial Port Enable bit
#define RCSTA1_SPEN_DISABLE						0X00
#define RCSTA1_RX9_9BIT_MODE					0X40		//9-bit Receive Enable bit
#define RCSTA1_RX9_8BIT_MODE					0X00
//RCSTA_SREN_ASYNC				DONT CARE
//RCSTA_SREN_SYNC_SLAVE			DONT CARE
#define RCSTA1_SREN_SYNC_MASTER_ENABLE			0X20		//Single Receive Enable bit
#define RCSTA1_SREN_SYNC_MASTER_DISABLE			0X00
#define RCSTA1_CREN_ASYNC_ENABLE				0X10		//Continuous Receive Enable bit
#define RCSTA1_CREN_ASYNC_DISABLE				0X00
#define RCSTA1_CREN_SYNC_ENABLE					0X10
#define RCSTA1_CREN_SYNC_DISABLE				0X00
//RCSTA1_ADDEN1_ASYNC_8BIT_MODE					DONT CARE	
#define RCSTA1_ADDEN_ASYNC_ENABLE_RX9			0X08		//Address Detect Enable bit
#define RCSTA1_ADDEN_ASYNC_DISABLE_RX9			0X00
#define RCSTA1_FERR_ERROR						1			//Framing Error bit
#define RCSTA1_FERR_NO_ERROR					0
#define RCSTA1_OERR_ERROR						1			//Overrun Error bit
#define RCSTA1_OERR_NO_ERROR					0
#define RCSTA1_RX9D_SET							1			//Ninth bit of Received Data
#define RCSTA1_RX9D_CLR							0

//RCSTA2: RECEIVE STATUS AND CONTROL REGISTER
#define RCSTA2_SPEN_ENABLE						0X80		//Serial Port Enable bit
#define RCSTA2_SPEN_DISABLE						0X00
#define RCSTA2_RX9_9BIT_MODE					0X40		//9-bit Receive Enable bit
#define RCSTA2_RX9_8BIT_MODE					0X00
//RCSTA_SREN_ASYNC				DONT CARE
//RCSTA_SREN_SYNC_SLAVE			DONT CARE
#define RCSTA2_SREN_SYNC_MASTER_ENABLE			0X20		//Single Receive Enable bit
#define RCSTA2_SREN_SYNC_MASTER_DISABLE			0X00
#define RCSTA2_CREN_ASYNC_ENABLE				0X10		//Continuous Receive Enable bit
#define RCSTA2_CREN_ASYNC_DISABLE				0X00
#define RCSTA2_CREN_SYNC_ENABLE					0X10
#define RCSTA2_CREN_SYNC_DISABLE				0X00
//RCSTA1_ADDEN1_ASYNC_8BIT_MODE					DONT CARE	
#define RCSTA2_ADDEN_ASYNC_ENABLE_RX9			0X08		//Address Detect Enable bit
#define RCSTA2_ADDEN_ASYNC_DISABLE_RX9			0X00
#define RCSTA2_FERR_ERROR						1			//Framing Error bit
#define RCSTA2_FERR_NO_ERROR					0
#define RCSTA2_OERR_ERROR						1			//Overrun Error bit
#define RCSTA2_OERR_NO_ERROR					0
#define RCSTA2_RX9D_SET							1			//Ninth bit of Received Data
#define RCSTA2_RX9D_CLR							0

//						
//BAUDCON1: BAUD RATE CONTROL REGISTER
#define BAUDCON_ABDOVF_TIMER_OVERFLOWED				0X80		//Auto-Baud Detect Overflow bit
#define BAUDCON_ABDOVF_TIMER_DID_NOT_OVERFLOWED		0X00
#define BAUDCON_RCIDL_IDLE						1
#define BAUDCON_RCIDL_ACTIVE					0
//UNDEFINED BIT
//BAUDCON_SCKP_ASYNC 						UNUSED
#define BAUDCON_SCKP_SYNC_HIGH					0X10
#define BAUDCON_SCKP_SYNC_LOW					0X00
#define BAUDCON_BRG16_BRG_16BIT					0X08
#define BAUDCON_BRG16_BRG_8BIT					0X00
//UNDEFINED BIT
//BAUDCON_WUE_SYNC							UNUSED
#define BAUDCON_WUE_ASYNC_ENABLE				0X02
#define BAUDCON_WUE_ASYNC_DISABLE				0X00
#define BAUDCON_ABDEN_ASYNC_ENABLE				0X01
#define BAUDCON_ABDEN_ASYNC_DISABLE				0X00
//DAY2
//ADCON0: A/D CONTROL REGISTER 0

#define	ADCON0_UNIMPLIMENTED			0X00
#define	ADCON0_CHS4_SET					0X40 		//CHS4:CHS0: Analog Channel Select bits	
#define	ADCON0_CHS4_CLR					0X00 	
#define	ADCON0_CHS3_SET					0X20 	
#define	ADCON0_CHS3_CLR					0X00
#define	ADCON0_CHS2_SET					0X10	
#define	ADCON0_CHS2_CLR					0X00
#define	ADCON0_CHS1_SET					0X08	
#define	ADCON0_CHS1_CLR					0X00
#define	ADCON0_CHS0_SET					0X04	
#define	ADCON0_CHS0_CLR					0X00
#define CHANNEL_AN0			ADCON0_CHS4_CLR|ADCON0_CHS3_CLR|ADCON0_CHS2_CLR|ADCON0_CHS1_CLR|ADCON0_CHS0_CLR		//channel_0 select bit.
#define CHANNEL_AN1			ADCON0_CHS4_CLR|ADCON0_CHS3_CLR|ADCON0_CHS2_CLR|ADCON0_CHS1_CLR|ADCON0_CHS0_SET		//channel_1 select bit.
#define CHANNEL_AN2			ADCON0_CHS4_CLR|ADCON0_CHS3_CLR|ADCON0_CHS2_CLR|ADCON0_CHS1_SET|ADCON0_CHS0_CLR		//channel_2 select bit.
#define CHANNEL_AN3			ADCON0_CHS4_CLR|ADCON0_CHS3_CLR|ADCON0_CHS2_CLR|ADCON0_CHS1_SET|ADCON0_CHS0_SET		//channel_3 select bit.
#define CHANNEL_AN4			ADCON0_CHS4_CLR|ADCON0_CHS3_CLR|ADCON0_CHS2_SET|ADCON0_CHS1_CLR|ADCON0_CHS0_CLR		//channel_5 select bit.#define	ADCON0_GO						0X02	//GO/DONE: A/D Conversion Status bit, When ADON = 1: 
#define CHANNEL_AN5			ADCON0_CHS4_CLR|ADCON0_CHS3_CLR|ADCON0_CHS2_SET|ADCON0_CHS1_CLR|ADCON0_CHS0_SET		//channel_6 select bit.
#define CHANNEL_AN6			ADCON0_CHS4_CLR|ADCON0_CHS3_CLR|ADCON0_CHS2_SET|ADCON0_CHS1_SET|ADCON0_CHS0_CLR		//channel_7 select bit.
#define CHANNEL_AN7			ADCON0_CHS4_CLR|ADCON0_CHS3_CLR|ADCON0_CHS2_SET|ADCON0_CHS1_SET|ADCON0_CHS0_SET		//channel_8 select bit.
#define CHANNEL_AN8			ADCON0_CHS4_CLR|ADCON0_CHS3_SET|ADCON0_CHS2_CLR|ADCON0_CHS1_CLR|ADCON0_CHS0_CLR		//channel_9 select bit.
#define CHANNEL_AN9			ADCON0_CHS4_CLR|ADCON0_CHS3_SET|ADCON0_CHS2_CLR|ADCON0_CHS1_CLR|ADCON0_CHS0_SET		//channel_10 select bit.
#define CHANNEL_AN10		ADCON0_CHS4_CLR|ADCON0_CHS3_SET|ADCON0_CHS2_CLR|ADCON0_CHS1_SET|ADCON0_CHS0_CLR		//channel_11 select bit.
#define CHANNEL_AN11		ADCON0_CHS4_CLR|ADCON0_CHS3_SET|ADCON0_CHS2_CLR|ADCON0_CHS1_SET|ADCON0_CHS0_SET		//channel_11 select bit.
#define CHANNEL_AN12		ADCON0_CHS4_CLR|ADCON0_CHS3_SET|ADCON0_CHS2_SET|ADCON0_CHS1_CLR|ADCON0_CHS0_CLR		//channel_12 select bit.
#define CHANNEL_AN13		ADCON0_CHS4_CLR|ADCON0_CHS3_SET|ADCON0_CHS2_SET|ADCON0_CHS1_CLR|ADCON0_CHS0_SET		//channel_13 select bit.
#define CHANNEL_AN14		ADCON0_CHS4_CLR|ADCON0_CHS3_SET|ADCON0_CHS2_SET|ADCON0_CHS1_SET|ADCON0_CHS0_CLR		//channel_14 select bit.
#define CHANNEL_AN15		ADCON0_CHS4_CLR|ADCON0_CHS3_SET|ADCON0_CHS2_SET|ADCON0_CHS1_SET|ADCON0_CHS0_SET		//channel_15 select bit.
#define CHANNEL_AN16		ADCON0_CHS4_SET|ADCON0_CHS3_CLR|ADCON0_CHS2_CLR|ADCON0_CHS1_CLR|ADCON0_CHS0_CLR		//channel_16 select bit.
#define CHANNEL_AN17		ADCON0_CHS4_SET|ADCON0_CHS3_CLR|ADCON0_CHS2_CLR|ADCON0_CHS1_CLR|ADCON0_CHS0_SET		//channel_17 select bit.
#define CHANNEL_AN18		ADCON0_CHS4_SET|ADCON0_CHS3_CLR|ADCON0_CHS2_CLR|ADCON0_CHS1_SET|ADCON0_CHS0_CLR		//channel_18 select bit.
#define CHANNEL_AN19		ADCON0_CHS4_SET|ADCON0_CHS3_CLR|ADCON0_CHS2_CLR|ADCON0_CHS1_SET|ADCON0_CHS0_SET		//channel_19 select bit.
#define CHANNEL_AN20		ADCON0_CHS4_SET|ADCON0_CHS3_CLR|ADCON0_CHS2_SET|ADCON0_CHS1_CLR|ADCON0_CHS0_CLR		//channel_20 select bit.
#define CHANNEL_AN21		ADCON0_CHS4_SET|ADCON0_CHS3_CLR|ADCON0_CHS2_SET|ADCON0_CHS1_CLR|ADCON0_CHS0_SET		//channel_21 select bit.
#define CHANNEL_AN22		ADCON0_CHS4_SET|ADCON0_CHS3_CLR|ADCON0_CHS2_SET|ADCON0_CHS1_SET|ADCON0_CHS0_CLR		//channel_22 select bit.
#define CHANNEL_AN23		ADCON0_CHS4_SET|ADCON0_CHS3_CLR|ADCON0_CHS2_SET|ADCON0_CHS1_SET|ADCON0_CHS0_SET		//channel_23 select bit.
#define CHANNEL_AN24		ADCON0_CHS4_SET|ADCON0_CHS3_SET|ADCON0_CHS2_CLR|ADCON0_CHS1_CLR|ADCON0_CHS0_CLR		//channel_24 select bit.
#define CHANNEL_AN25		ADCON0_CHS4_SET|ADCON0_CHS3_SET|ADCON0_CHS2_CLR|ADCON0_CHS1_CLR|ADCON0_CHS0_SET		//channel_25 select bit.
#define CHANNEL_AN26		ADCON0_CHS4_SET|ADCON0_CHS3_SET|ADCON0_CHS2_CLR|ADCON0_CHS1_SET|ADCON0_CHS0_CLR		//channel_26 select bit.
#define CHANNEL_AN27		ADCON0_CHS4_SET|ADCON0_CHS3_SET|ADCON0_CHS2_CLR|ADCON0_CHS1_SET|ADCON0_CHS0_SET		//channel_27 select bit.
#define RESERVED			ADCON0_CHS4_SET|ADCON0_CHS3_SET|ADCON0_CHS2_SET|ADCON0_CHS1_CLR|ADCON0_CHS0_CLR		//Reserved
#define CTMU				ADCON0_CHS4_SET|ADCON0_CHS3_SET|ADCON0_CHS2_SET|ADCON0_CHS1_CLR|ADCON0_CHS0_SET		//CTMU
#define DAC					ADCON0_CHS4_SET|ADCON0_CHS3_SET|ADCON0_CHS2_SET|ADCON0_CHS1_SET|ADCON0_CHS0_CLR		//DAC
#define FVR_BUF2			ADCON0_CHS4_SET|ADCON0_CHS3_SET|ADCON0_CHS2_SET|ADCON0_CHS1_SET|ADCON0_CHS0_SET		//FVR BUF2 (1.024V/2.048V/2.096V Volt Fixed Voltage Reference)

#define ADCON0_GO						0x02	//start the convertion
#define ADCON0_DONE						0x00	//convertion finished
#define	ADCON0_ADON_ENABLE				0X01	//ADON: A/D On bit
#define	ADCON0_ADON_DISABLE				0X00



// ADCON1: A/D CONTROL REGISTER 1

#define ADCON1_TRIGSEL_CTMU				0x80
#define ADCON1_TRIGSEL_CCP5				0x00
#define ADCON1_UNIMPLIMENTED_BIT6		0X00
#define ADCON1_UNIMPLIMENTED_BIT5		0X00
#define ADCON1_UNIMPLIMENTED_BIT4		0X00

