sunitha-rs/documents/Serial_Ports/case_3/uarthardware/P18F46K22Generic.h
#define ADCON1_PVCFG_BIT3_SET				0x08 	//VCFG1: Voltage Reference Configuration bit (VREF- source)
#define ADCON1_PVCFG_BIT3_CLR				0X00
#define ADCON1_PVCFG_BIT2_SET				0X04
#define ADCON1_PVCFG_BIT2_CLR				0X00
#define ADC_VREF_CONNECTED_TO_INTERNAL_SIGNAL_AVDD 							(ADCON1_PVCFG_BIT3_CLR)|(ADCON1_PVCFG_BIT2_CLR)	
#define ADC_VREF_CONNECTED_TO_EXTERNAL_PIN_VREFPOS							(ADCON1_PVCFG_BIT3_CLR)|(ADCON1_PVCFG_BIT2_SET)			
#define ADC_VREF_CONNECTED_TO_INTERNAL_SIGNAL_FVR_BUF2						(ADCON1_PVCFG_BIT3_SET)|(ADCON1_PVCFG_BIT2_CLR)			
#define RESERVED_BY_DEFAULT_ADC_VREFPOS_CONNECTED_TO_INTERNAL SIGNAL_AVDD	(ADCON1_PVCFG_BIT3_SET)|(ADCON1_PVCFG_BIT2_SET)		

#define ADCON1_NVCFG0_BIT1_SET			0x02 	
#define ADCON1_NVCFG0_BIT1_CLR			0x00
#define ADCON1_NVCFG0_BIT0_SET			0x01
#define ADCON1_NVCFG0_BIT0_CLR			0x00   
#define ADC_VREFNEG_CONNECTED_TO_INTERNAL_SIGNAL_AVSS						(ADCON1_NVCFG0_BIT1_CLR)|(ADCON1_NVCFG0_BIT0_CLR)		
#define ADC VREFNEG_CONNECTED_TO_EXTERNAL_PIN_VREFNEG						(ADCON1_NVCFG0_BIT1_CLR)|(ADCON1_NVCFG0_BIT0_SET)	
#define RESERVED_BIT1															(ADCON1_NVCFG0_BIT1_SET)|(ADCON1_NVCFG0_BIT0_CLR)	
#define RESERVED_BIT0															ADCON1_NVCFG0_BIT1_SET|ADCON1_NVCFG0_BIT0_SET	

// ADCON2: A/D CONTROL REGISTER 2

#define ADCON2_ADFM_RIGHT				0X80	//ADFM: A/D Result Format Select bit
#define ADCON2_ADFM_LEFT				0X00
#define UNIMPLEMENTED					0x00
#define ADCON2_ACQT2_BIT5_SET			0X20	//ACQT2:ACQT0: A/D Acquisition Time Select bits
#define ADCON2_ACQT2_BIT5_CLR			0X00
#define ADCON2_ACQT1_BIT4_SET			0X10
#define ADCON2_ACQT1_BIT4_CLR			0X00
#define ADCON2_ACQT0_BIT3_SET			0X08
#define ADCON2_ACQT0_BIT3_CLR			0X00
#define ADCON2_TAD_0		ADCON2_ACQT2_BIT5_CLR|ADCON2_ACQT1_BIT4_CLR|ADCON2_ACQT0_BIT3_CLR
#define ADCON2_TAD_2		ADCON2_ACQT2_BIT5_CLR|ADCON2_ACQT1_BIT4_CLR|ADCON2_ACQT0_BIT3_SET
#define ADCON2_TAD_4		ADCON2_ACQT2_BIT5_CLR|ADCON2_ACQT1_BIT4_SET|ADCON2_ACQT0_BIT3_CLR	
#define ADCON2_TAD_6		ADCON2_ACQT2_BIT5_CLR|ADCON2_ACQT1_BIT4_SET|ADCON2_ACQT0_BIT3_SET	
#define ADCON2_TAD_8		ADCON2_ACQT2_BIT5_SET|ADCON2_ACQT1_BIT4_CLR|ADCON2_ACQT0_BIT3_CLR		
#define ADCON2_TAD_12		ADCON2_ACQT2_BIT5_SET|ADCON2_ACQT1_BIT4_CLR|ADCON2_ACQT0_BIT3_SET
#define ADCON2_TAD_16		ADCON2_ACQT2_BIT5_SET|ADCON2_ACQT1_BIT4_SET|ADCON2_ACQT0_BIT3_CLR
#define ADCON2_TAD_20		ADCON2_ACQT2_BIT5_SET|ADCON2_ACQT1_BIT4_SET|ADCON2_ACQT0_BIT3_SET	
		
#define ADCON2_ADCS2_BIT2_SET			0X04	//ADCS2:ADCS0: A/D Conversion Clock Select bits
#define ADCON2_ADCS2_BIT2_CLR			0X00
#define ADCON2_ADCS1_BIT1_SET			0X02
#define ADCON2_ADCS1_BIT1_CLR			0X00
#define ADCON2_ADCS0_BIT0_SET			0X01
#define ADCON2_ADCS0_BIT2_CLR			0X00
#define ADCON2_FOSC_BY_2	ADCON2_ADCS2_BIT2_CLR|ADCON2_ADCS1_BIT1_CLR|ADCON2_ADCS0_BIT2_CLR
#define ADCON2_FOSC_BY_8	ADCON2_ADCS2_BIT2_CLR|ADCON2_ADCS1_BIT1_CLR|ADCON2_ADCS0_BIT2_SET
#define ADCON2_FOSC_BY_32	ADCON2_ADCS2_BIT2_CLR|ADCON2_ADCS1_BIT1_SET|ADCON2_ADCS0_BIT2_CLR
#define ADCON2_FOSC_RC_1		ADCON2_ADCS2_BIT2_CLR|ADCON2_ADCS1_BIT1_SET|ADCON2_ADCS0_BIT2_SET
#define ADCON2_FOSC_BY_4	ADCON2_ADCS2_BIT2_SET|ADCON2_ADCS1_BIT1_CLR|ADCON2_ADCS0_BIT2_CLR
#define ADCON2_FOSC_BY_16	ADCON2_ADCS2_BIT2_SET|ADCON2_ADCS1_BIT1_CLR|ADCON2_ADCS0_BIT2_SET
#define ADCON2_FOSC_BY_64	ADCON2_ADCS2_BIT2_SET|ADCON2_ADCS1_BIT1_SET|ADCON2_ADCS0_BIT2_CLR
#define ADCON2_FOSC_RC_2		ADCON2_ADCS2_BIT2_SET|ADCON2_ADCS1_BIT1_SET|ADCON2_ADCS0_BIT2_SET

//INTCON: INTERRUPT CONTROL REGISTER
//#define INTCON_GIE_IPEN_LOW				0X80
//#define INTCON_GIE_IPEN_LOW				0X00
//#define INTCON_GIE_IPEN_HIGH			0X80
//#define INTCON_GIE_IPEN_HIGH			0X00


//CMCON: COMPARATOR CONTROL REGISTER

#define CMCON_C2OUT_SET					0x80	//C2OUT: Comparator 2 Output bit	(dependant on C2INV status)
#define CMCON_C2OUT_CLR					0x00
#define CMCON_C1OUT_SET					0x40	//C1OUT: Comparator 1 Output bit	(dependant on C1INV status)
#define CMCON_C1OUT_CLR					0x00
#define CMCON_C2INV_INVERT				0x20$	//C2INV: Comparator 2 Output Inversion bit
#define CMCON_C2INV_NOT_INVERT			0x00
#define CMCON_C1INV_INVERT				0x10	//C1INV: Comparator 1 Output Inversion bit
#define CMCON_C1INV_NOT_INVERT			0x00
#define CMCON_CIS_INPUT_RA3RA2			0x08	//CIS: Comparator Input Switch bit
#define CMCON_CIS_NOT_INPUT_RA0RA1		0x00
#define CMCON_CM2_SET					0X04	//CM2:CM0: Comparator Mode bits
#define CMCON_CM2_CLR					0X00
#define CMCON_CM1_SET					0X02
#define CMCON_CM1_CLR					0X00
#define CMCON_CM0_SET					0X01
#define CMCON_CM0_CLR					0X00

//CVRCON: COMPARATOR VOLTAGE REFERENCE CONTROL REGISTER

#define CVRCON_CVREN_ENABLE					0X80	//CVREN: Comparator Voltage Reference Enable bit
#define CVRCON_CVREN_DISABLE				0X00
#define CVRCON_CVROE_ENABLE						0X40	//CVROE: Comparator VREF Output Enable bit
#define CVRCON_CVROE_DISABLE				0X00
#define CVRCON_CVRR_LOW_RANGE				0X20	//CVRR: Comparator VREF Range Selection bit
#define CVRCON_CVRR_HIGH_RANGE				0X00
#define CVRCON_CVRSS_VREFPOSNEG				0X10$	//CVRSS: Comparator VREF Source Selection bit
#define CVRCON_CVRSS_VREFVDDVSS				0X00
#define CVRCON_CVR3_SET						0X08	//CVR3:CVR0: Comparator VREF Value Selection bits (0 = (CVR3:CVR0) = 15) 
#define CVRCON_CVR3_CLR						0X00
#define CVRCON_CVR2_SET						0X04
#define CVRCON_CVR2_CLR						0X00
#define CVRCON_CVR1_SET						0X02
#define CVRCON_CVR1_CLR						0X00
#define CVRCON_CVR0_SET						0X01
#define CVRCON_CVR0_CLR						0X00

//HLVDCON: HIGH/LOW-VOLTAGE DETECT CONTROL REGISTER

#define HLVDCON_VDIRMAG_EQUAL_ABOVE			0X80	//VDIRMAG: Voltage Direction Magnitude Select bit
#define HLVDCON_VDIRMAG_EQUAL_BELOW			0X00 
//BIT6 UNDEFINED/UNIMPLEMENTED
#define HLVDCON_IRVST_GENERATE_INT			0X01$	//Internal Reference Voltage Stable Flag bit
#define HLVDCON_IRVST_NOT_GENERATE_INT		0X00
#define HLVDCON_IHLVDEN_ENABLE				0X10 	// High/Low-Voltage Detect Power Enable bit
#define HLVDCON_IHLVDEN_DISABLE				0X00
#define HLVDCON_HLVDL3_SET					0X08	//HLVDL3:HLVDL0: Voltage Detection Limit bits
#define HLVDCON_HLVDL3_CLR					0X00
#define HLVDCON_HLVDL2_SET					0X04
#define HLVDCON_HLVDL2_CLR					0X00
#define HLVDCON_HLVDL1_SET					0X02
#define HLVDCON_HLVDL1_CLR					0X00
#define HLVDCON_HLVDL0_SET					0X01
#define HLVDCON_HLVDL0_CLR					0X00

//CONFIG1H: CONFIGURATION REGISTER 1 HIGH (BYTE ADDRESS 300001h)

#define	CONFIG1H_IESO_ENABLE				0X80 	//IESO: Internal/External Oscillator Switchover bit
#define	CONFIG1H_IESO_DISABLE				0X00
#define	CONFIG1H_FCMEN_ENABLE				0X40	//FCMEN: Fail-Safe Clock Monitor Enable bit
#define	CONFIG1H_FCMEN_DISABLE				0X00
//BIT5 & BIT4 UNDEFINED/UNIMPLEMENTED
#define	CONFIG1H_FOSC3_SET					0X08	//FOSC3:FOSC0: Oscillator Selection bits
#define	CONFIG1H_FOSC3_CLR					0X00
#define	CONFIG1H_FOSC2_SET					0X04
#define	CONFIG1H_FOSC2_CLR					0X00
#define	CONFIG1H_FOSC1_SET					0X02
#define	CONFIG1H_FOSC1_CLR					0X00
#define	CONFIG1H_FOSC0_SET					0X01
#define	CONFIG1H_FOSC0_CLR					0X00

