sunitha-rs/documents/Serial_Ports/case_3/uarthardware/P18F46K22Generic.h
//CONFIG2L: CONFIGURATION REGISTER 2 LOW (BYTE ADDRESS 300002h) 

//BIT7 & BIT6 & BIT5  UNDEFINED/UNIMPLEMENTED
#define CONFIG2L_BORV1_SET					0X10	//BORV1:BORV0: Brown-out Reset Voltage bits
#define CONFIG2L_BORV1_CLR					0X00
#define CONFIG2L_BORV0_SET					0X08	
#define CONFIG2L_BORV0_CLR					0X00
#define CONFIG2L_BOREN1_SET					0X04	//BOREN1:BOREN0: Brown-out Reset Enable bits
#define CONFIG2L_BOREN1_CLR					0X00
#define CONFIG2L_BOREN0_SET					0X02
#define CONFIG2L_BOREN0_CLR					0X00
#define CONFIG2L_PWRTEN_ENABLE				0X00	//PWRTEN: Power-up Timer Enable bit
#define CONFIG2L_PWRTEN_DISABLE				0X01

//CONFIG2H: CONFIGURATION REGISTER 2 HIGH (BYTE ADDRESS 300003h)

//BIT7 & BIT6 & BIT5  UNDEFINED/UNIMPLEMENTED
#define CONFIG2H_WDTPS3_SET					0X10	//WDTPS3:WDTPS0: Watchdog Timer Postscale Select bits
#define CONFIG2H_WDTPS3_CLR					0X00
#define CONFIG2H_WDTPS2_SET					0X08
#define CONFIG2H_WDTPS2_CLR					0X00
#define CONFIG2H_WDTPS1_SET					0X04
#define CONFIG2H_WDTPS1_CLR					0X00
#define CONFIG2H_WDTPS0_SET					0X02
#define CONFIG2H_WDTPS0_CLR					0X00
#define CONFIG2H_WDTEN_ENABLE				0X01	//WDTEN: Watchdog Timer Enable bit
#define CONFIG2H_WDTEN_DISABLE				0X00

//CONFIG3H: CONFIGURATION REGISTER 3 HIGH (BYTE ADDRESS 300005h)

#define CONFIG3H_MCLRE_ENABLE				0X80	//MCLRE: MCLR Pin Enable bit 
#define CONFIG3H_MCLRE_DISABLE				0X00
//BIT6 & BIT5 & BIT4 & BIT3  UNDEFINED/UNIMPLEMENTED
#define CONFIG3H_LPT1OSC_ENABLE				0X04	//LPT1OSC: Low-Power Timer1 Oscillator Enable bit
#define CONFIG3H_LPT1OSC_DISABLE			0X00
#define CONFIG3H_PBADEN_ENABLE				0X02	//PBADEN: PORTB A/D Enable bit 
#define CONFIG3H_PBADEN_DISABLE				0X00
#define CONFIG3H_CCP2MX_RC1					0X01	//CCP2MX: CCP2 MUX bit
#define CONFIG3H_CCP2MX_RB3					0X00

//CONFIG4L: CONFIGURATION REGISTER 4 LOW (BYTE ADDRESS 300006h)

#define CONFIG4L_DEBUG_ENABLE				0X00	//DEBUG(BAR): Background Debugger Enable bit
#define CONFIG4L_DEBUG_DISABLE				0X80
#define CONFIG4L_XINST_ENABLE				0X40	//XINST: Extended Instruction Set Enable bit
#define CONFIG4L_XINST_DISABLE				0X00
//BIT56 & BIT4 & BIT3  UNDEFINED/UNIMPLEMENTED
#define CONFIG4L_LVP_ENABLE					0X04	//LVP: Single-Supply ICSP™ Enable bit
#define CONFIG4L_LVP_DISABLE				0X00
// BIT1  UNDEFINED/UNIMPLEMENTED
#define CONFIG4L_STVREN_ENABLE				0X01	//STVREN: Stack Full/Underflow Reset Enable bit
#define CONFIG4L_STVREN_DISABLE				0X00

//LATD

#define LATD_LATD7_SET						0x80
#define LATD_LATD7_CLR						0x00
#define LATD_LATD6_SET						0x40
#define LATD_LATD6_CLR						0x00
#define LATD_LATD5_SET						0x20
#define LATD_LATD5_CLR						0x00
#define LATD_LATD4_SET						0x10
#define LATD_LATD4_CLR						0x00
#define LATD_LATD3_SET						0x08
#define LATD_LATD3_CLR						0x00
#define LATD_LATD2_SET						0x04
#define LATD_LATD2_CLR						0x00
#define LATD_LATD1_SET						0x02
#define LATD_LATD1_CLR						0x00
#define LATD_LATD0_SET						0x01
#define LATD_LATD0_CLR						0x00


//TRISD
#define TRISD_TRISD7_SET					0x80
#define TRISD_TRISD7_CLR					0x00
#define TRISD_TRISD6_SET					0x40
#define TRISD_TRISD6_CLR					0x00
#define TRISD_TRISD5_SET					0x20
#define TRISD_TRISD5_CLR					0x00
#define TRISD_TRISD4_SET					0x10
#define TRISD_TRISD4_CLR					0x00
#define TRISD_TRISD3_SET					0x08
#define TRISD_TRISD3_CLR					0x00
#define TRISD_TRISD2_SET					0x04
#define TRISD_TRISD2_CLR					0x00
#define TRISD_TRISD1_SET					0x02
#define TRISD_TRISD1_CLR					0x00
#define TRISD_TRISD0_SET					0x01
#define TRISD_TRISD0_CLR					0x00

//SSP1STAT: SSP1 STATUS REGISTER

#define SSP1STAT_SMP_SET_SPI_MASER_MODE			0X80			//SPI Data Input Sample bit
#define SSP1STAT_SMP_CLR_SPI_MASER_MODE			0X00
#define SSP1STAT_SMP_CLR_SPI_SLAVE_MODE			0X00
#define SSP1STAT_SMP_SET_I2C_MODE				0X80
#define SSP1STAT_SMP_CLR_I2C_MODE				0X00
#define SSP1STAT_CKE_SET_SPI_MODE				0X40			//SPI Clock Edge Select bit (SPI mode only)
#define SSP1STAT_CKE_CLR_SPI_MODE				0X00
#define SSP1STAT_CKE_SET_I2C_MODE				0X40
#define SSP1STAT_CKE_CLR_I2C_MODE				0X00	
#define SSP1STAT_D_TO_A_SET_I2C_MODE				0X20			//Data/Address bit (I2C mode only)
#define SSP1STAT_D_TO_A_CLR_I2C_MODE				0X00
#define SSP1STAT_P_SET_I2C_MODE					0X10			//Stop bit
#define SSP1STAT_P_CLR_I2C_MODE					0X00
#define SSP1STAT_S_SET_I2C_MODE					0X08			//Start bit
#define SSP1STAT_S_CLR_I2C_MODE					0X00
#define SSP1STAT_RW_SET_I2C_MASTER_MODE		0X04			//Read/Write bit information (I2C mode only)
#define SSP1STAT_RW_CLR_I2C_MASTER_MODE		0X00
#define SSP1STAT_RW_SET_I2C_SLAVE_MODE			0X04
#define SSP1STAT_RW_CLR_I2C_SLAVE_MODE			0X00
#define SSP1STAT_UA_SET_I2C_MODE				0X02			//Update Address bit (10-bit I2C mode only)
#define SSP1STAT_UA_CLR_I2C_MODE				0X00
#define SSP1STAT_BF_SET_RECEIVE_SPI_OR_I2C_MODE				0X01	//Buffer Full Status bit
#define SSP1STAT_BF_CLR_RECEIVE_SPI_OR_I2C_MODE				0X00
#define SSP1STAT_BF_SET_TRANSMIT_I2C_MODE					0X01
#define SSP1STAT_BF_CLR_TRANSMIT_I2C_MODE					0X00

//SSP2STAT: SSP2 STATUS REGISTER

#define SSP2STAT_SMP_SET_SPI_MASER_MODE			0X80			//SPI Data Input Sample bit
#define SSP2STAT_SMP_CLR_SPI_MASER_MODE			0X00
#define SSP2STAT_SMP_CLR_SPI_SLAVE_MODE			0X00
#define SSP2STAT_SMP_SET_I2C_MODE				0X80
#define SSP2STAT_SMP_CLR_I2C_MODE				0X00
#define SSP2STAT_CKE_SET_SPI_MODE				0X40			//SPI Clock Edge Select bit (SPI mode only)
#define SSP2STAT_CKE_CLR_SPI_MODE				0X00
#define SSP2STAT_CKE_SET_I2C_MODE				0X40
#define SSP2STAT_CKE_CLR_I2C_MODE				0X00	
#define SSP2STAT_D_TO_A_SET_I2C_MODE				0X20			//Data/Address bit (I2C mode only)
#define SSP2STAT_D_TO_A_CLR_I2C_MODE				0X00
#define SSP2STAT_P_SET_I2C_MODE					0X10			//Stop bit
#define SSP2STAT_P_CLR_I2C_MODE					0X00
#define SSP2STAT_S_SET_I2C_MODE					0X08			//Start bit
#define SSP2STAT_S_CLR_I2C_MODE					0X00
#define SSP2STAT_RW_SET_I2C_MASTER_MODE		0X04			//Read/Write bit information (I2C mode only)
#define SSP2STAT_RW_CLR_I2C_MASTER_MODE		0X00
#define SSP2STAT_RW_SET_I2C_SLAVE_MODE			0X04
#define SSP2STAT_RW_CLR_I2C_SLAVE_MODE			0X00
#define SSP2STAT_UA_SET_I2C_MODE				0X02			//Update Address bit (10-bit I2C mode only)
#define SSP2STAT_UA_CLR_I2C_MODE				0X00
#define SSP2STAT_BF_SET_RECEIVE_SPI_OR_I2C_MODE				0X01	//Buffer Full Status bit
#define SSP2STAT_BF_CLR_RECEIVE_SPI_OR_I2C_MODE				0X00
#define SSP2STAT_BF_SET_TRANSMIT_I2C_MODE					0X01
#define SSP2STAT_BF_CLR_TRANSMIT_I2C_MODE					0X00

