sunitha-rs/documents/Serial_Ports/case_3/uarthardware/P18F46K22Generic.h
//SSP1CON1: SSP1 CONTROL REGISTER 1
#define SSP1CON1_WCOL_SET_MASTER_MODE			0X80			//Write Collision Detect bit
#define SSP1CON1_WCOL_CLR_MASTER_MODE			0X00
#define SSP1CON1_WCOL_SET_SLAVE_MODE			0X80
#define SSP1CON1_WCOL_CLR_SLAVE_MODE			0X00
#define SSP1CON1_SSP1OV_SET_SPI_MODE			0X40			//Receive Overflow Indicator bit
#define SSP1CON1_SSP1OV_CLR_SPI_MODE			0X00
#define SSP1CON1_SSP1OV_SET_I2C_MODE			0X40
#define SSP1CON1_SSP1OV_CLR_I2C_MODE			0X00
#define SSP1CON1_SSP1EN_SET_SPI_MODE			0X20			//Synchronous Serial Port Enable bit
#define SSP1CON1_SSP1EN_CLR_SPI_MODE			0X00
#define SSP1CON1_SSP1EN_SET_I2C_MODE			0X20
#define SSP1CON1_SSP1EN_CLR_I2C_MODE			0X00
#define SSP1CON1_CKP_SET_SPI_MODE				0X10			//Clock Polarity Select bit
#define SSP1CON1_CKP_CLR_SPI_MODE				0X00
#define SSP1CON1_CKP_SET_I2C_SLAVE_MODE			0X10			
#define SSP1CON1_CKP_CLR_I2C_SLAVE_MODE			0X00
#define SSP1CON1_CKP_CLR_I2C_MASTER_MODE		0X00			//Unused in the master mode
#define SSP1CON1_SSP1M_BIT3_SET			0X08
#define SSP1CON1_SSP1M_BIT3_CLR			0X00
#define SSP1CON1_SSP1M_BIT2_SET			0X04
#define SSP1CON1_SSP1M_BIT2_CLR			0X00
#define SSP1CON1_SSP1M_BIT1_SET			0X02
#define SSP1CON1_SSP1M_BIT1_CLR			0X00
#define SSP1CON1_SSP1M_BIT0_SET			0X01
#define SSP1CON1_SSP1M_BIT0_CLR			0X00
#define SSP1_SPI_MASTER_MODE_CLOCK_FOSC_BY_4				SSP1CON1_SSP1M_BIT3_CLR | SSP1CON1_SSP1M_BIT2_CLR | SSP1CON1_SSP1M_BIT1_CLR | SSP1CON1_SSP1M_BIT0_CLR
#define SSP1_SPI_MASTER_MODE_CLOCK_FOSC_BY_16				SSP1CON1_SSP1M_BIT3_CLR | SSP1CON1_SSP1M_BIT2_CLR | SSP1CON1_SSP1M_BIT1_CLR | SSP1CON1_SSP1M_BIT0_SET
#define SSP1_SPI_MASTER_MODE_CLOCK_FOSC_BY_64				SSP1CON1_SSP1M_BIT3_CLR | SSP1CON1_SSP1M_BIT2_CLR | SSP1CON1_SSP1M_BIT1_SET | SSP1CON1_SSP1M_BIT0_CLR
#define SSP1_SPI_MASTER_MODE_CLOCK_TMR2_OUTPUT_BY_2			SSP1CON1_SSP1M_BIT3_CLR | SSP1CON1_SSP1M_BIT2_CLR | SSP1CON1_SSP1M_BIT1_SET | SSP1CON1_SSP1M_BIT0_SET
#define SSP1_SPI_SLAVE_MODE_CLOCK_SCK1_PIN					SSP1CON1_SSP1M_BIT3_CLR | SSP1CON1_SSP1M_BIT2_SET | SSP1CON1_SSP1M_BIT1_CLR | SSP1CON1_SSP1M_BIT0_CLR
#define SSP1_SPI_SLAVE_MODE_CLOCK_SCK1_PIN1					SSP1CON1_SSP1M_BIT3_CLR | SSP1CON1_SSP1M_BIT2_SET | SSP1CON1_SSP1M_BIT1_CLR | SSP1CON1_SSP1M_BIT0_SET
#define	SSP1_I2C_SLAVE_MODE_7BIT_ADDRESS					SSP1CON1_SSP1M_BIT3_CLR | SSP1CON1_SSP1M_BIT2_SET | SSP1CON1_SSP1M_BIT1_SET | SSP1CON1_SSP1M_BIT0_CLR 
#define SSP1_I2C_SLAVE_MODE_10_BIT_ADDRESS					SSP1CON1_SSP1M_BIT3_CLR | SSP1CON1_SSP1M_BIT2_SET | SSP1CON1_SSP1M_BIT1_SET | SSP1CON1_SSP1M_BIT0_SET
#define SSP1_I2C_MASTER_MODE_CLOCK							SSP1CON1_SSP1M_BIT3_SET | SSP1CON1_SSP1M_BIT2_CLR | SSP1CON1_SSP1M_BIT1_CLR | SSP1CON1_SSP1M_BIT0_CLR
#define SSP1_RESERVED_0										SSP1CON1_SSP1M_BIT3_SET | SSP1CON1_SSP1M_BIT2_CLR | SSP1CON1_SSP1M_BIT1_CLR | SSP1CON1_SSP1M_BIT0_SET
#define SSP1_SPI_MASTER_MODE_CLOCK							SSP1CON1_SSP1M_BIT3_SET | SSP1CON1_SSP1M_BIT2_CLR | SSP1CON1_SSP1M_BIT1_SET | SSP1CON1_SSP1M_BIT0_CLR
#define SSP1_I2C_FIRMWARE_CONTROLLED_MASTER_MODE			SSP1CON1_SSP1M_BIT3_SET | SSP1CON1_SSP1M_BIT2_CLR | SSP1CON1_SSP1M_BIT1_SET | SSP1CON1_SSP1M_BIT0_SET
#define SSP1_RESERVED_1										SSP1CON1_SSP1M_BIT3_SET | SSP1CON1_SSP1M_BIT2_SET | SSP1CON1_SSP1M_BIT1_CLR | SSP1CON1_SSP1M_BIT0_CLR
#define SSP1_RESERVED_2									SSP1CON1_SSP1M_BIT3_SET | SSP1CON1_SSP1M_BIT2_SET | SSP1CON1_SSP1M_BIT1_CLR | SSP1CON1_SSP1M_BIT0_SET
#define SSP1_I2C_SLAVE_MODE_7_BIT_ADDRESS_WITH_START_AND_STOP_BIT_INTERRUPTS_ENABLED		SSP1CON1_SSP1M_BIT3_SET | SSP1CON1_SSP1M_BIT2_SET | SSP1CON1_SSP1M_BIT1_SET | SSP1CON1_SSP1M_BIT0_CLR
#define SSP1_I2C_SLAVE_MODE_10_BIT_ADDRESS_WITH_START_AND_STOP_BIT_INTERRUPTS_ENABLED	SSP1CON1_SSP1M_BIT3_SET | SSP1CON1_SSP1M_BIT2_SET | SSP1CON1_SSP1M_BIT1_SET | SSP1CON1_SSP1M_BIT0_SET

//SSP2CON1: SSP2 CONTROL REGISTER 1
#define SSP2CON1_WCOL_SET_MASTER_MODE			0X80			//Write Collision Detect bit
#define SSP2CON1_WCOL_CLR_MASTER_MODE			0X00
#define SSP2CON1_WCOL_SET_SLAVE_MODE			0X80
#define SSP2CON1_WCOL_CLR_SLAVE_MODE			0X00
#define SSP2CON1_SSP2OV_SET_SPI_MODE			0X40			//Receive Overflow Indicator bit
#define SSP2CON1_SSP2OV_CLR_SPI_MODE			0X00
#define SSP2CON1_SSP2OV_SET_I2C_MODE			0X40
#define SSP2CON1_SSP2OV_CLR_I2C_MODE			0X00
#define SSP2CON1_SSP2EN_SET_SPI_MODE			0X20			//Synchronous Serial Port Enable bit
#define SSP2CON1_SSP2EN_CLR_SPI_MODE			0X00
#define SSP2CON1_SSP2EN_SET_I2C_MODE			0X20
#define SSP2CON1_SSP2EN_CLR_I2C_MODE			0X00
#define SSP2CON1_CKP_SET_SPI_MODE				0X10			//Clock Polarity Select bit
#define SSP2CON1_CKP_CLR_SPI_MODE				0X00
#define SSP2CON1_CKP_SET_I2C_SLAVE_MODE			0X10			
#define SSP2CON1_CKP_CLR_I2C_SLAVE_MODE			0X00
#define SSP2CON1_CKP_CLR_I2C_MASTER_MODE		0X00			//Unused in the master mode
#define SSP2CON1_SSP2M_BIT3_SET			0X08
#define SSP2CON1_SSP2M_BIT3_CLR			0X00
#define SSP2CON1_SSP2M_BIT2_SET			0X04
#define SSP2CON1_SSP2M_BIT2_CLR			0X00
#define SSP2CON1_SSP2M_BIT1_SET			0X02
#define SSP2CON1_SSP2M_BIT1_CLR			0X00
#define SSP2CON1_SSP2M_BIT0_SET			0X01
#define SSP2CON1_SSP2M_BIT0_CLR			0X00
#define SSP2_SPI_MASTER_MODE_CLOCK_FOSC_BY_4						SSP2CON1_SSP2M_BIT3_CLR | SSP2CON1_SSP2M_BIT2_CLR | SSP2CON1_SSP2M_BIT1_CLR | SSP2CON1_SSP2M_BIT0_CLR
#define SSP2_SPI_MASTER_MODE_CLOCK_FOSC_BY_16						SSP2CON1_SSP2M_BIT3_CLR | SSP2CON1_SSP2M_BIT2_CLR | SSP2CON1_SSP2M_BIT1_CLR | SSP2CON1_SSP2M_BIT0_SET
#define SSP2_SPI_MASTER_MODE_CLOCK_FOSC_BY_64						SSP2CON1_SSP2M_BIT3_CLR | SSP2CON1_SSP2M_BIT2_CLR | SSP2CON1_SSP2M_BIT1_SET | SSP2CON1_SSP2M_BIT0_CLR
#define SSP2_SPI_MASTER_MODE_CLOCK_TMR2_OUTPUT_BY_2					SSP2CON1_SSP2M_BIT3_CLR | SSP2CON1_SSP2M_BIT2_CLR | SSP2CON1_SSP2M_BIT1_SET | SSP2CON1_SSP2M_BIT0_SET
#define SSP2_SPI_SLAVE_MODE_CLOCK_SCK2_PIN_SS1_PIN_CONTROL_ENABLED	SSP2CON1_SSP2M_BIT3_CLR | SSP2CON1_SSP2M_BIT2_SET | SSP2CON1_SSP2M_BIT1_CLR | SSP2CON1_SSP2M_BIT0_CLR
#define SSP2_SPI_SLAVE_MODE_CLOCK_SCK2_PIN_SS1_PIN_CONTROL_DISABLED	SSP2CON1_SSP2M_BIT3_CLR | SSP2CON1_SSP2M_BIT2_SET | SSP2CON1_SSP2M_BIT1_CLR | SSP2CON1_SSP2M_BIT0_SET
#define SSP2_I2C_SLAVE_MODE_7_BIT_ADDRESS							SSP2CON1_SSP2M_BIT3_CLR | SSP2CON1_SSP2M_BIT2_SET | SSP2CON1_SSP2M_BIT1_SET | SSP2CON1_SSP2M_BIT0_CLR
#define SSP2_I2C_SLAVE_MODE_10_BIT_ADDRESS							SSP2CON1_SSP2M_BIT3_CLR | SSP2CON1_SSP2M_BIT2_SET | SSP2CON1_SSP2M_BIT1_SET | SSP2CON1_SSP2M_BIT0_SET
#define SSP2_I2C_MASTER_MODE_CLOCK									SSP2CON1_SSP2M_BIT3_SET | SSP2CON1_SSP2M_BIT2_CLR | SSP2CON1_SSP2M_BIT1_CLR | SSP2CON1_SSP2M_BIT0_CLR
#define SSP2_RESERVED_0												SSP2CON1_SSP2M_BIT3_SET | SSP2CON1_SSP2M_BIT2_CLR | SSP2CON1_SSP2M_BIT1_CLR | SSP2CON1_SSP2M_BIT0_SET
#define SSP2_SPI_MASTER_MODE_CLOCK									SSP2CON1_SSP2M_BIT3_SET | SSP2CON1_SSP2M_BIT2_CLR | SSP2CON1_SSP2M_BIT1_SET | SSP2CON1_SSP2M_BIT0_CLR
#define SSP2_I2C_FIRMWARE_CONTROLLED_MASTER_MODE					SSP2CON1_SSP2M_BIT3_SET | SSP2CON1_SSP2M_BIT2_CLR | SSP2CON1_SSP2M_BIT1_SET | SSP2CON1_SSP2M_BIT0_SET
#define SSP2_RESERVED_1												SSP2CON1_SSP2M_BIT3_SET | SSP2CON1_SSP2M_BIT2_SET | SSP2CON1_SSP2M_BIT1_CLR | SSP2CON1_SSP2M_BIT0_CLR
#define SSP2_RESERVED_2												SSP2CON1_SSP2M_BIT3_SET | SSP2CON1_SSP2M_BIT2_SET | SSP2CON1_SSP2M_BIT1_CLR | SSP2CON1_SSP2M_BIT0_SET
#define SSP2_I2C_SLAVE_MODE_7_BIT_ADDRESS_WITH_START_AND_STOP_BIT_INTERRUPTS_ENABLED		SSP2CON1_SSP2M_BIT3_SET | SSP2CON1_SSP2M_BIT2_SET | SSP2CON1_SSP2M_BIT1_SET | SSP2CON1_SSP2M_BIT0_CLR
#define SSP2_I2C_SLAVE_MODE_10_BIT_ADDRESS_WITH_START_AND_STOP_BIT_INTERRUPTS_ENABLED	SSP2CON1_SSP2M_BIT3_SET | SSP2CON1_SSP2M_BIT2_SET | SSP2CON1_SSP2M_BIT1_SET | SSP2CON1_SSP2M_BIT0_SET


//SSP1CON2: SSP1 CONTROL REGISTER 2
#define SSP1CON2_GCEN_SET				0X80				//General Call Enable bit (in I2C Slave mode only)
#define SSP1CON2_GCEN_CLR				0X00
#define SSP1CON2_ACKSTAT_SET			0X40				//Acknowledge Status bit (in I2C mode only)
#define SSP1CON2_ACKSTAT_CLR			0X00
#define SSP1CON2_ACKDT_SET				0X20				//Acknowledge Data bit (in I2C mode only)
#define SSP1CON2_ACKDT_CLR				0X00
#define SSP1CON2_ACKEN_SET				0X10				//Acknowledge Sequence Enable bit (in I2C Master Receive mode only)
#define SSP1CON2_ACKEN_CLR				0X00
#define SSP1CON2_RCEN_SET				0X08				//Receive Enable bit (in I2C Master mode only)
#define SSP1CON2_RCEN_CLR				0X00
#define SSP1CON2_PEN_SET				0X04				//Stop Condition Enable bit (in I2C Master mode only),SCK Release Control
#define SSP1CON2_PEN_CLR				0X00
#define SSP1CON2_RSEN_SET				0X02				//Repeated Start Condition Enabled bit (in I2C Master mode only)
#define SSP1CON2_RSEN_CLR				0X00
#define SSP1CON2_SEN_SET_MASTER_MODE	0X01				//Start Condition Enabled bit (in I2C Master mode only)
#define SSP1CON2_SEN_CLR_MASTER_MODE	0X00
#define SSP1CON2_SEN_SET_SLAVE_MODE		0X01				//Start Condition Enabled bit (in I2C Master mode only)
#define SSP1CON2_SEN_CLR_SLAVE_MODE		0X00

