sunitha-rs/documents/Serial_Ports/case_3/uarthardware/P18F46K22Generic.h
//SSP1CON2: SSP2 CONTROL REGISTER 2
#define SSP2CON2_GCEN_SET				0X80				//General Call Enable bit (in I2C Slave mode only)
#define SSP2CON2_GCEN_CLR				0X00
#define SSP2CON2_ACKSTAT_SET			0X40				//Acknowledge Status bit (in I2C mode only)
#define SSP2CON2_ACKSTAT_CLR			0X00
#define SSP2CON2_ACKDT_SET				0X20				//Acknowledge Data bit (in I2C mode only)
#define SSP2CON2_ACKDT_CLR				0X00
#define SSP2CON2_ACKEN_SET				0X10				//Acknowledge Sequence Enable bit (in I2C Master Receive mode only)
#define SSP2CON2_ACKEN_CLR				0X00
#define SSP2CON2_RCEN_SET				0X08				//Receive Enable bit (in I2C Master mode only)
#define SSP2CON2_RCEN_CLR				0X00
#define SSP2CON2_PEN_SET				0X04				//Stop Condition Enable bit (in I2C Master mode only),SCK Release Control
#define SSP2CON2_PEN_CLR				0X00
#define SSP2CON2_RSEN_SET				0X02				//Repeated Start Condition Enabled bit (in I2C Master mode only)
#define SSP2CON2_RSEN_CLR				0X00
#define SSP2CON2_SEN_SET_MASTER_MODE	0X01				//Start Condition Enabled bit (in I2C Master mode only)
#define SSP2CON2_SEN_CLR_MASTER_MODE	0X00
#define SSP2CON2_SEN_SET_SLAVE_MODE		0X01				//Start Condition Enabled bit (in I2C Master mode only)
#define SSP2CON2_SEN_CLR_SLAVE_MODE		0X00

//SSP1CON3: SSP1 CONTROL REGISTER 3
#define SSP1CON3_ACKTIM_SET				0X80				//Acknowledge Time Status bit (I2C mode only)
#define SSP1CON3_ACKTIM_CLR				0X00
#define SSP1CON3_PCIE_SET				0X40				//Stop Condition Interrupt Enable bit (I2C mode only)
#define SSP1CON3_PCIE_CLR				0X00
#define SSP1CON3_SCIE_SET				0X20				//Start Condition Interrupt Enable bit (I2C mode only)
#define SSP1CON3_SCIE_CLR				0X00
#define SSP1CON3_BOEN_SET_SPI_SLAVE_MODE		0X10		//Buffer Overwrite Enable bit
#define SSP1CON3_BOEN_CLR_SPI_SLAVE_MODE		0X00
//In I2C Master mode: This bit is ignored
#define SSP1CON3_BOEN_SET_I2C_SLAVE_MODE		0X10
#define SSP1CON3_BOEN_CLR_I2C_SLAVE_MODE		0X00
#define SSP1CON3_SDAHT_SET				0X08				//SDA1 Hold Time Selection bit (I2C mode only)
#define SSP1CON3_SDAHT_CLR				0X00
#define SSP1CON3_SBCDE_SET				0X04				//Slave Mode Bus Collision Detect Enable bit (I2C Slave mode only)
#define SSP1CON3_SBCDE_CLR				0X00
#define SSP1CON3_AHEN_SET				0X02				//Address Hold Enable bit (I2C Slave mode only)
#define SSP1CON3_AHEN_CLR				0X00
#define SSP1CON3_DHEN_SET				0X01				//Data Hold Enable bit (I2C Slave mode only)
#define SSP1CON3_DHEN_CLR				0X00	


//SSP1CON3: SSP2 CONTROL REGISTER 3
#define SSP2CON3_ACKTIM_SET				0X80				//Acknowledge Time Status bit (I2C mode only)
#define SSP2CON3_ACKTIM_CLR				0X00
#define SSP2CON3_PCIE_SET				0X40				//Stop Condition Interrupt Enable bit (I2C mode only)
#define SSP2CON3_PCIE_CLR				0X00
#define SSP2CON3_SCIE_SET				0X20				//Start Condition Interrupt Enable bit (I2C mode only)
#define SSP2CON3_SCIE_CLR				0X00
#define SSP2CON3_BOEN_SET_SPI_SLAVE_MODE		0X10		//Buffer Overwrite Enable bit
#define SSP2CON3_BOEN_CLR_SPI_SLAVE_MODE		0X00
//In I2C Master mode: This bit is ignored
#define SSP2CON3_BOEN_SET_I2C_SLAVE_MODE		0X10
#define SSP2CON3_BOEN_CLR_I2C_SLAVE_MODE		0X00
#define SSP2CON3_SDAHT_SET				0X08				//SDA1 Hold Time Selection bit (I2C mode only)
#define SSP2CON3_SDAHT_CLR				0X00
#define SSP2CON3_SBCDE_SET				0X04				//Slave Mode Bus Collision Detect Enable bit (I2C Slave mode only)
#define SSP2CON3_SBCDE_CLR				0X00
#define SSP2CON3_AHEN_SET				0X02				//Address Hold Enable bit (I2C Slave mode only)
#define SSP2CON3_AHEN_CLR				0X00
#define SSP2CON3_DHEN_SET				0X01				//Data Hold Enable bit (I2C Slave mode only)
#define SSP2CON3_DHEN_CLR				0X00	

//SSP1MSK: SSP1 MASK REGISTER
#define SSP1MSK_MSK_BIT_7_SET			0X80				//Mask bits
#define SSP1MSK_MSK_BIT_7_CLR			0X00
#define SSP1MSK_MSK_BIT_6_SET			0X40
#define SSP1MSK_MSK_BIT_6_CLR			0X00
#define SSP1MSK_MSK_BIT_5_SET			0X20
#define SSP1MSK_MSK_BIT_5_CLR			0X00
#define SSP1MSK_MSK_BIT_4_SET			0X10
#define SSP1MSK_MSK_BIT_4_CLR			0X00
#define SSP1MSK_MSK_BIT_3_SET			0X08
#define SSP1MSK_MSK_BIT_3_CLR			0X00
#define SSP1MSK_MSK_BIT_2_SET			0X04
#define SSP1MSK_MSK_BIT_2_CLR			0X00
#define SSP1MSK_MSK_BIT_1_SET			0X02
#define SSP1MSK_MSK_BIT_1_CLR			0X00
#define SSP1MSK_MSK_BIT_0_SET			0X01
#define SSP1MSK_MSK_BIT_0_CLR			0X00

//SSP2MSK: SSP2 MASK REGISTER
#define SSP2MSK_MSK_BIT_7_SET			0X80				//Mask bits
#define SSP2MSK_MSK_BIT_7_CLR			0X00
#define SSP2MSK_MSK_BIT_6_SET			0X40
#define SSP2MSK_MSK_BIT_6_CLR			0X00
#define SSP2MSK_MSK_BIT_5_SET			0X20
#define SSP2MSK_MSK_BIT_5_CLR			0X00
#define SSP2MSK_MSK_BIT_4_SET			0X10
#define SSP2MSK_MSK_BIT_4_CLR			0X00
#define SSP2MSK_MSK_BIT_3_SET			0X08
#define SSP2MSK_MSK_BIT_3_CLR			0X00
#define SSP2MSK_MSK_BIT_2_SET			0X04
#define SSP2MSK_MSK_BIT_2_CLR			0X00
#define SSP2MSK_MSK_BIT_1_SET			0X02
#define SSP2MSK_MSK_BIT_1_CLR			0X00
#define SSP2MSK_MSK_BIT_0_SET			0X01
#define SSP2MSK_MSK_BIT_0_CLR			0X00

